In [147]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory
from sklearn.model_selection import train_test_split
import os
print(os.listdir("../input"))

# Any results you write to the current directory are saved as output.

['train.csv', 'gender_submission.csv', 'test.csv']

In [148]:
from sklearn import tree
train_data_1 = pd.read_csv("../input/train.csv",sep=",")
train_data_1.head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
4            5         0       3    ...      8.0500   NaN         S

[5 rows x 12 columns]

In [149]:
train_data_1 = train_data_1.drop(columns=['Name','Ticket','Cabin'])
train_data_1.head()

   PassengerId  Survived  Pclass    ...    Parch     Fare  Embarked
0            1         0       3    ...        0   7.2500         S
1            2         1       1    ...        0  71.2833         C
2            3         1       3    ...        0   7.9250         S
3            4         1       1    ...        0  53.1000         S
4            5         0       3    ...        0   8.0500         S

[5 rows x 9 columns]

In [150]:
gender = {"male":0,"female": 1}
train_data_1.Sex=[gender[item] for item in train_data_1.Sex]
train_data_1.head()

   PassengerId  Survived  Pclass  Sex    ...     SibSp  Parch     Fare  Embarked
0            1         0       3    0    ...         1      0   7.2500         S
1            2         1       1    1    ...         1      0  71.2833         C
2            3         1       3    1    ...         0      0   7.9250         S
3            4         1       1    1    ...         1      0  53.1000         S
4            5         0       3    0    ...         0      0   8.0500         S

[5 rows x 9 columns]

In [151]:
train_data_1.dropna(inplace=True)
embarked = {"S":2,"C":0,"Q":1}
train_data_1.Embarked=[embarked[item] for item in train_data_1.Embarked]
train_data_1.head()

   PassengerId  Survived  Pclass  Sex    ...     SibSp  Parch     Fare  Embarked
0            1         0       3    0    ...         1      0   7.2500         2
1            2         1       1    1    ...         1      0  71.2833         0
2            3         1       3    1    ...         0      0   7.9250         2
3            4         1       1    1    ...         1      0  53.1000         2
4            5         0       3    0    ...         0      0   8.0500         2

[5 rows x 9 columns]

In [152]:
train_data_1.head()

   PassengerId  Survived  Pclass  Sex    ...     SibSp  Parch     Fare  Embarked
0            1         0       3    0    ...         1      0   7.2500         2
1            2         1       1    1    ...         1      0  71.2833         0
2            3         1       3    1    ...         0      0   7.9250         2
3            4         1       1    1    ...         1      0  53.1000         2
4            5         0       3    0    ...         0      0   8.0500         2

[5 rows x 9 columns]

In [156]:
labels = train_data_1['Survived']
features = train_data_1.drop(columns='Survived')
X_train, X_test, y_train, y_test = train_test_split(features,labels, test_size=0.25)

In [157]:

clf = tree.DecisionTreeClassifier()
clf = clf.fit(X_train,y_train)

In [158]:
test_data_1 = pd.read_csv("../input/test.csv")
test_data_1.head()

   PassengerId  Pclass   ...    Cabin Embarked
0          892       3   ...      NaN        Q
1          893       3   ...      NaN        S
2          894       2   ...      NaN        Q
3          895       3   ...      NaN        S
4          896       3   ...      NaN        S

[5 rows x 11 columns]

In [159]:
test_data_1.dropna(inplace=True)
embarked = {"S":2,"C":0,"Q":1}
test_data_1.Embarked=[embarked[item] for item in test_data_1.Embarked]

In [160]:
gender = {"male":0,"female": 1}
test_data_1.Sex=[gender[item] for item in test_data_1.Sex]

In [161]:
test_data_1 = test_data_1.drop(columns=['Name','Ticket','Cabin'])

In [162]:
test_data_1.head()

    PassengerId  Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
12          904       1    1  23.0      1      0   82.2667         2
14          906       1    1  47.0      1      0   61.1750         2
24          916       1    1  48.0      1      3  262.3750         0
26          918       1    1  22.0      0      1   61.9792         0
28          920       1    0  41.0      0      0   30.5000         2

In [164]:
y_predict = clf.predict(X_test)

In [165]:
from sklearn.metrics import accuracy_score
acc = accuracy_score(y_test,y_predict)
print(acc)

0.702247191011236